OpenFOAM-2112/reservoir_localEuler/0.model/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            codedMixed;
        refValue        uniform 49050;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        name            fixedWaterPressure1;
        code
        #{
            const scalarField rhop = patch().lookupPatchField<volScalarField, scalar>("rho");
            this->refValue() = rhop * 9.81 * 5.00;
            this->refGrad() = Zero;
            this->valueFraction() = max(min(3.0 - this->patch().Cf().component(2), 1.0), 0.0);
        #};
    }
    outlet
    {
        type            fixedFluxPressure;
    }
    "(spillway|left|right|bottom)"
    {
        type            fixedFluxPressure;
    }
    lid
    {
        type            totalPressure;
        p0              uniform 78.48;
    }
}

// ************************************************************************* //
